app/controllers/short_urls_controller.rb

  def index
    @short_urls = ShortUrl.order(click_count: :desc)
---
SELECT `short_urls`.* FROM `short_urls` ORDER BY `short_urls`.`click_count` DESC

  def create
    full_url = params[:full_url]

    @short_url = ShortUrl.create_or_find_by(full_url: full_url)
---
INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('https://google.com', '2021-04-23 15:08:39.323672', '2021-04-23 15:08:39.323672')