app/models/short_url.rb

  def self.short_code
    number_of_records = ShortUrl.count
---
SELECT COUNT(*) FROM `short_urls`